# StructuralAssetClass Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralAsset..::..StructuralAssetClass Property
StructuralAsset Class See Also
---
The type of material that this structural asset describes (e.g. wood, concrete, metal.)
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public StructuralAssetClass StructuralAssetClass { get; }
```

Visual Basic
---
```text
Public ReadOnly Property StructuralAssetClass As StructuralAssetClass
	Get
```

Visual C++
---
```text
public:
property StructuralAssetClass StructuralAssetClass {
	StructuralAssetClass get ();
}
```

# See Also
StructuralAsset Class
Autodesk.Revit.DB Namespace